Revit 2027 API
BuiltInFailures.WallFailures.WallLacksCurve Property
 Wall does not have both a curve driver and a curve!!!!
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WallLacksCurve { get; }
Public Shared ReadOnly Property WallLacksCurve As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WallLacksCurve {
	FailureDefinitionId^ get ();
}
static member WallLacksCurve : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace